<template>
  <div class="text">
      <h3>Ремонт ванных комнат</h3>
      <p>Ванная комната — это пространство, где утро начинается и вечер завершается. Оформление ванной комнаты играет важную роль в создании комфортного и функционального пространства. Обычно она оснащена раковиной, унитазом и ванной или душевой кабиной.</p>
      <p>Зеркало является важным элементом, так как его часто используют для утреннего ухода за лицом и макияжа. Освещение в ванной комнате играет ключевую роль: мягкий свет создаёт уютную атмосферу, а яркий — обеспечивает комфорт при бритье или нанесении макияжа. Шкафчики и полочки помогают поддерживать порядок, храня туалетные принадлежности и полотенца. Современные ванные комнаты нередко включают тёплые полы, которые особенно приятно использовать в холодное время года</p>.
      <p>Стильная сантехника и качественные материалы, такие как плитка и стекло, способствуют долговечности и лёгкому уходу за поверхностями. Большое значение имеет и выбор цветов: светлые оттенки визуально увеличивают пространство, а тёмные — придают глубину и элегантность. Ванная комната может быть дополнена различными аксессуарами, такими как коврики, занавески для душа, держатели для полотенец и декоративные элементы, что придаёт ей индивидуальный стиль. Растения и ароматические свечи создают атмосферу релаксации и уюта, превращая ванную комнату в настоящее место для отдыха и восстановления сил после долгого дня.</p>
      <p>Планировка ванной комнаты должна учитывать потребности всех членов семьи, обеспечивая удобство и безопасность. Например, наличие поручней и нескользящих ковриков может быть важно для пожилых людей.</p>
      <p>Ванная комната — это не только функциональное помещение, но и место для уединения и заботы о себе, где каждый может насладиться моментом покоя и расслабления.</p>
    </div>
</template>
<style>
  .text {
    margin: 0 15vw;
  }
  .text h3{
    text-align: center;
    font-family: 'Cormorant Garamond', serif;
    font-size: 2.7em;
    font-weight: 400;
  }
  .text p {
    font-family: 'Montserrat', sans-serif;
    line-height: 1.5em;
  }
</style>
